; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-5-2)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	s0 - location
	s1 - location
	s2 - location
	p1-0 - location
	p1-2 - location
	p2-0 - location
	p2-1 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s1)
	(at driver3 s2)
	(at driver4 s0)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at truck5 s2)
	(empty truck5)
	(at package1 s1)
	(at package2 s1)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 41)
	(= (time-to-walk p1-0 s1) 41)
	(= (time-to-walk s0 p1-0) 96)
	(= (time-to-walk p1-0 s0) 96)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 35)
	(= (time-to-walk p1-2 s1) 35)
	(= (time-to-walk s2 p1-2) 28)
	(= (time-to-walk p1-2 s2) 28)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 81)
	(= (time-to-walk p2-0 s2) 81)
	(= (time-to-walk s0 p2-0) 9)
	(= (time-to-walk p2-0 s0) 9)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 41)
	(= (time-to-drive s1 s0) 41)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 2)
	(= (time-to-drive s2 s1) 2)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 10)
	(= (time-to-drive s0 s2) 10)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s0)
	(at driver4 s0)
	(at truck3 s1)
	(at truck4 s1)
	(at truck5 s1)
	(at package1 s2)
	))

(:metric minimize (+ (+ (* 4  (total-time)) (* 2  (driven))) (* 2  (walked))))

)

; plan
1. (walk driver2 s1 p1-0)
   deleted: (at driver2 s1)
   added: (at driver2 p1-0)
   changed: (walked) from 0 to 41
   goals met: 1 of 7
2. (board-truck driver3 truck5 s2)
   deleted: (at driver3 s2) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 1 of 7
3. (drive-truck truck5 s2 s1 driver3)
   deleted: (at truck5 s2)
   added: (at truck5 s1)
   changed: (driven) from 0 to 2
   goals met: 2 of 7
4. (load-truck package1 truck5 s1)
   deleted: (at package1 s1)
   added: (in package1 truck5)
   goals met: 2 of 7
5. (board-truck driver4 truck4 s0)
   deleted: (at driver4 s0) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 1 of 7
6. (walk driver2 p1-0 s0)
   deleted: (at driver2 p1-0)
   added: (at driver2 s0)
   changed: (walked) from 41 to 137
   goals met: 2 of 7
7. (walk driver1 s1 p1-2)
   deleted: (at driver1 s1)
   added: (at driver1 p1-2)
   changed: (walked) from 137 to 172
   goals met: 2 of 7
8. (drive-truck truck5 s1 s2 driver3)
   deleted: (at truck5 s1)
   added: (at truck5 s2)
   changed: (driven) from 2 to 4
   goals met: 1 of 7
9. (disembark-truck driver3 truck5 s2)
   deleted: (driving driver3 truck5)
   added: (at driver3 s2) (empty truck5)
   goals met: 1 of 7
10. (board-truck driver3 truck3 s2)
   deleted: (at driver3 s2) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 1 of 7
11. (drive-truck truck3 s2 s1 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s1)
   changed: (driven) from 4 to 6
   goals met: 2 of 7
12. (disembark-truck driver4 truck4 s0)
   deleted: (driving driver4 truck4)
   added: (at driver4 s0) (empty truck4)
   goals met: 3 of 7
13. (board-truck driver2 truck4 s0)
   deleted: (at driver2 s0) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 2 of 7
14. (drive-truck truck4 s0 s1 driver2)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   changed: (driven) from 6 to 47
   goals met: 3 of 7
15. (drive-truck truck3 s1 s0 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (driven) from 47 to 88
   goals met: 2 of 7
16. (drive-truck truck4 s1 s0 driver2)
   deleted: (at truck4 s1)
   added: (at truck4 s0)
   changed: (driven) from 88 to 129
   goals met: 1 of 7
17. (disembark-truck driver3 truck3 s0)
   deleted: (driving driver3 truck3)
   added: (at driver3 s0) (empty truck3)
   goals met: 1 of 7
18. (walk driver1 p1-2 s1)
   deleted: (at driver1 p1-2)
   added: (at driver1 s1)
   changed: (walked) from 172 to 207
   goals met: 1 of 7
19. (disembark-truck driver2 truck4 s0)
   deleted: (driving driver2 truck4)
   added: (at driver2 s0) (empty truck4)
   goals met: 2 of 7
20. (walk driver4 s0 p2-0)
   deleted: (at driver4 s0)
   added: (at driver4 p2-0)
   changed: (walked) from 207 to 216
   goals met: 1 of 7
21. (walk driver4 p2-0 s2)
   deleted: (at driver4 p2-0)
   added: (at driver4 s2)
   changed: (walked) from 216 to 297
   goals met: 1 of 7
22. (board-truck driver2 truck3 s0)
   deleted: (at driver2 s0) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 0 of 7
23. (walk driver4 s2 p2-0)
   deleted: (at driver4 s2)
   added: (at driver4 p2-0)
   changed: (walked) from 297 to 378
   goals met: 0 of 7
24. (walk driver4 p2-0 s0)
   deleted: (at driver4 p2-0)
   added: (at driver4 s0)
   changed: (walked) from 378 to 387
   goals met: 1 of 7
25. (drive-truck truck3 s0 s2 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   changed: (driven) from 129 to 139
   goals met: 1 of 7
26. (disembark-truck driver2 truck3 s2)
   deleted: (driving driver2 truck3)
   added: (at driver2 s2) (empty truck3)
   goals met: 1 of 7
27. (board-truck driver2 truck5 s2)
   deleted: (at driver2 s2) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 1 of 7
28. (board-truck driver4 truck4 s0)
   deleted: (at driver4 s0) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 0 of 7
29. (disembark-truck driver2 truck5 s2)
   deleted: (driving driver2 truck5)
   added: (at driver2 s2) (empty truck5)
   goals met: 0 of 7
30. (board-truck driver2 truck3 s2)
   deleted: (at driver2 s2) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 0 of 7
31. (drive-truck truck3 s2 s0 driver2)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   changed: (driven) from 139 to 149
   goals met: 0 of 7
32. (disembark-truck driver2 truck3 s0)
   deleted: (driving driver2 truck3)
   added: (at driver2 s0) (empty truck3)
   goals met: 1 of 7
33. (walk driver1 s1 p1-2)
   deleted: (at driver1 s1)
   added: (at driver1 p1-2)
   changed: (walked) from 387 to 422
   goals met: 1 of 7
34. (board-truck driver2 truck3 s0)
   deleted: (at driver2 s0) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 0 of 7
35. (unload-truck package1 truck5 s2)
   deleted: (in package1 truck5)
   added: (at package1 s2)
   goals met: 1 of 7
36. (drive-truck truck3 s0 s1 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (driven) from 149 to 190
   goals met: 2 of 7
37. (drive-truck truck4 s0 s1 driver4)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   changed: (driven) from 190 to 231
   goals met: 3 of 7
38. (disembark-truck driver4 truck4 s1)
   deleted: (driving driver4 truck4)
   added: (at driver4 s1) (empty truck4)
   goals met: 3 of 7
39. (drive-truck truck3 s1 s0 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (driven) from 231 to 272
   goals met: 2 of 7
40. (disembark-truck driver2 truck3 s0)
   deleted: (driving driver2 truck3)
   added: (at driver2 s0) (empty truck3)
   goals met: 3 of 7
41. (walk driver1 p1-2 s1)
   deleted: (at driver1 p1-2)
   added: (at driver1 s1)
   changed: (walked) from 422 to 457
   goals met: 3 of 7
42. (walk driver4 s1 p1-2)
   deleted: (at driver4 s1)
   added: (at driver4 p1-2)
   changed: (walked) from 457 to 492
   goals met: 3 of 7
43. (board-truck driver3 truck3 s0)
   deleted: (at driver3 s0) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 3 of 7
44. (walk driver1 s1 p1-0)
   deleted: (at driver1 s1)
   added: (at driver1 p1-0)
   changed: (walked) from 492 to 533
   goals met: 3 of 7
45. (drive-truck truck3 s0 s1 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (driven) from 272 to 313
   goals met: 4 of 7
46. (disembark-truck driver3 truck3 s1)
   deleted: (driving driver3 truck3)
   added: (at driver3 s1) (empty truck3)
   goals met: 4 of 7
47. (walk driver4 p1-2 s2)
   deleted: (at driver4 p1-2)
   added: (at driver4 s2)
   changed: (walked) from 533 to 561
   goals met: 4 of 7
48. (walk driver4 s2 p2-0)
   deleted: (at driver4 s2)
   added: (at driver4 p2-0)
   changed: (walked) from 561 to 642
   goals met: 4 of 7
49. (walk driver4 p2-0 s0)
   deleted: (at driver4 p2-0)
   added: (at driver4 s0)
   changed: (walked) from 642 to 651
   goals met: 5 of 7
50. (walk driver3 s1 p1-2)
   deleted: (at driver3 s1)
   added: (at driver3 p1-2)
   changed: (walked) from 651 to 686
   goals met: 5 of 7
51. (walk driver1 p1-0 s0)
   deleted: (at driver1 p1-0)
   added: (at driver1 s0)
   changed: (walked) from 686 to 782
   goals met: 6 of 7
52. (walk driver3 p1-2 s2)
   deleted: (at driver3 p1-2)
   added: (at driver3 s2)
   changed: (walked) from 782 to 810
   goals met: 6 of 7
53. (board-truck driver3 truck5 s2)
   deleted: (at driver3 s2) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 6 of 7
54. (drive-truck truck5 s2 s1 driver3)
   deleted: (at truck5 s2)
   added: (at truck5 s1)
   changed: (driven) from 313 to 315
   goals met: 7 of 7
